artillery.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:8000/api/v1
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 50
      rampTo: 80
      name: Ramp up load
    - duration: 120
      arrivalRate: 10
      rampTo: 100
      name: Spike phase
  processor: "./dataGenerate.js"

  # plugins:
  #   ensure: {}
  #   apdex: {}
  #   metrics-by-endpoint: {}
  # apdex:
  #   threshold: 100
  # ensure:
  #     thresholds:
  #       - http.response_time.p99: 100
  #       - http.response_time.p95: 75
scenarios:
  - flow:
     - post:
          url: "/users"
          beforeRequest: "generateRandomBody"
          json: "{{ data }}"