artillery.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:8000/api/v1
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    # - duration: 60
    #   arrivalRate: 5
    #   rampTo: 20
    #   name: Ramp up load
    # - duration: 120
    #   arrivalRate: 10
    #   rampTo: 50
    #   name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  # plugins:
  #   ensure: {}
  #   apdex: {}
  #   metrics-by-endpoint: {}
  # apdex:
  #   threshold: 100
  # ensure:
  #     thresholds:
  #       - http.response_time.p99: 100
  #       - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - post:
              url: "/users"
              json: '{{ require("./dataGenerate.js").generateRandomBody() }}'
          - think: 1